app/Controllers/Admin/ProductController.php

SELECT *
FROM `products`
ORDER BY `created_at` DESC
---
    public function index()
    {
        return view('admin/products/index', [
            'title' => 'Admin Products',
            'products' => (new ProductModel())->orderBy('created_at', 'DESC')->findAll(),

SELECT *
FROM `products`
WHERE `products`.`id` = 2
---
    public function edit(int $id)
    {
        $product = (new ProductModel())->find($id);

SELECT *
FROM `products`
WHERE `products`.`id` = 2
UPDATE `products` SET `name` = 'Timeless1800 96% Wireless Mechanical Keyboard', `description` = 'Timeless1800 96% Wireless Mechanical Keyboard Gasket Mount - Linear, Tactile, Silent', `price` = 1469000, `stock` = 48, `image` = '1777965868_af58a2f313703257f77f.jpeg', `image_secondary` = '1777965868_76de7e29dff92fad2453.jpeg', `updated_at` = '2026-05-05 14:24:28'
WHERE `products`.`id` IN (2)
---
    public function update(int $id)
    {
        $model = new ProductModel();
        $product = $model->find($id);
        if (! $product) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound('Product not found');
        }

        $data = $this->validatedData();
        if ($data === null) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        // Handle Primary Image
        $image = $this->handleUpload('image', false);
        if ($image !== null) {
            $data['image'] = $image;
            $this->deleteImage($product['image']);
        }

        // Handle Secondary Image
        $imageSecondary = $this->handleUpload('image_secondary', false);
        if ($imageSecondary !== null) {
            $data['image_secondary'] = $imageSecondary;
            $this->deleteImage($product['image_secondary']);
        }

        $model->update($id, $data);